[

    {
        "Description": "You awake in a stupor, unaware of your surroundings. Fighting the throbbing pain in your head, you surmise that you are in some sort of dungeon. \nThere are three tunnels leading from the room, one to the left, right and center. Which way will you go?",
        "Image_Path": "Images\\Awakening.png",
        "Choices": [
            {
                "Choice_Description": "Left",
                "Choice_link": 1
            },
            {
                "Choice_Description": "Center",
                "Choice_link": 2
            },
            {
                "Choice_Description": "Right",
                "Choice_link": 3
            }
        ]

    },
    {

        "Description": "Making your way down the left most tunnel, you stumble into a cavern that doesn't appear to have been man made. As your eyes adjust to the darkness, you make out a large, lumbering silhouette charging towards you.\nThe beast's stench can only mean one thing, an ogre. What will you do?",
        "Image_Path": "Images\\Ogre.png",
        "Choices": [
            {
                "Choice_Description": "Fight",
                "Choice_link": 4
            },
            {
                "Choice_Description": "Attempt to make peace",
                "Choice_link": 5
            },
            {
                "Choice_Description": "Run back down the tunnel",
                "Choice_link": 6
            }
        ]
        
    },
    {
        "Description": "Walking down the center tunnel, you stumble into a completely dark room. Your eyes strain to perceive what appears to be unlit torches hanging on the walls.\n You come to realize you are not alone, as the chirping and fluttering of bats begins to fill your ears. How do you react?",
        "Image_Path": "Images\\Ogre.png",
        "Choices": [
            {
                "Choice_Description": "Light the torches",
                "Choice_link": 7
            },
            {
                "Choice_Description": "Sneak through the room",
                "Choice_link": 8
            },
            {
                "Choice_Description": "Attack the bats",
                "Choice_link": 9
            }
        ]
    },
    {
        "Description": "Choosing the right tunnel, you come to a circular chamber. Once within, you make out inane human ramblings coming from a haggard, bloodied adventurer.\nYou step closer to comfort him, yet his mutterings only grow more frenzied. ''Demons are here, demons are here,'' he repeats to himself over and over...",
        "Image_Path": "Images\\Ogre.png",
        "Choices": [
            {
                "Choice_Description": "Talk to him in an attempt to calm him down",
                "Choice_link": 10
            },
            {
                "Choice_Description": "Take no chances, kill him",
                "Choice_link": 11
            },
            {
                "Choice_Description": "Ignore him and attempt to walk past him",
                "Choice_link": 12
            }
        ]
    },
    {
        "Description": "You throw down your longsword and kneel to the ground as the ogre charges you. Right as it is about to strike you down it pauses, confused at your gesture.\n Seeing that you don't intend to make yourself a threat, it lets you pass by unharmed. You pass through a small man-sized hole in the cavern into a large vault, with jewels and gold littered throughout the room.\nDespite the splendor of it all, an air of unease hangs over you. Something is not quite right. What will you do?",
        "Image_Path": "Images\\Ogre.png",
        "Choices": [
            {
                "Choice_Description": "Ignore the uneasy feeling, stuff as much loot as you can into your pack as it can hold",
                "Choice_link": 13

            },
            {
                "Choice_Description": "Survey the room for the source of uneasiness",
                "Choice_link": 14
            },
            {
                "Choice_Description": "Waste no time leaving the room",
                "Choice_link": 15
            }
        ]
    },
    {
        "Description": "As the ogre charges you, you draw your longsword and assume a defensive stance. Right as it is about to barrel into you, you sidestep to the left and swing at its throat. The beast falls over dead.\nYou pass through a small man-sized hole in the cavern into a large vault, with jewels and gold littered throughout the room. Despite the splendor of it all, an air of unease hangs over you. Something is not quite right. What will you do?",
        "Image_Path": "Images\\Ogre_charging.png",
        "Choices": [
            {
                "Choice_Description": "Ignore the uneasy feeling, stuff as much loot as you can into your pack as it can hold",
                "Choice_link": 13

            },
            {
                "Choice_Description": "Survey the room for the source of uneasiness",
                "Choice_link": 14
            },
            {
                "Choice_Description": "Waste no time leaving the room",
                "Choice_link": 15
            }
        ]
    },
    {
        "Description": "You attempt to run back down the tunnel you came from. Right as you reach the opening, you feel a large hand grip your waist. The ogre picks you up and slams you into the ground repeatedly, until the only thing that remains of you is red paste.",
        "Image_Path": "Images\\Ogre_death.png",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            }
        ]
    },
    {
        "Description": "You take a matchbox from your pack, lighting the nearby torches. The bats begin to stir angrily until the flames scare them away. You make your way out of the room. The frightened bats you fled from suddenly look more appealing than the sight currently in front of you. You are standing in a stone room, lit by candlelight. In the center of the room is an altar, on top of which lays a bloody dagger. Various effigies to some bat-like deity aline the room. You feel a dark presence beckoning you to the knife.",
        "Image_Path": "Images\\bat_torches.png",
        "Choices": [
            {
                "Choice_Description":"Attempt to speak to the deity",
                "Choice_link": 16
            },
            {
                "Choice_Description":"Give in to the dark presence.",
                "Choice_link": 17
            },
            {
                "Choice_Description":"Reject the presence, destroy the effigies.",
                "Choice_link": 18
            }
        ]


    },
    {
    "Description": "You creep across the room, taking great care not disturb the sleeping bats. You run your hands along the wall until you find a door. Swinging it open, you quickly pass through and slam it shut. Once out, you hear the angry whir of the bats behind the door. The screeching bats you fled from suddenly look more appealing than the sight currently in front of you. You are standing in a stone room, lit by candlelight. In the center of the room is an altar, on top of which lays a bloody dagger. Various effigies to some bat-like deity aline the room. You feel a dark presence beckoning you to the knife.",
    "Image_Path": "Images\\Dark_cave.png",
    "Choices": [
    {
        "Choice_Description":"Attempt to speak to the deity",
        "Choice_link": 16
    },
    {
        "Choice_Description":"Give in to the dark presence.",
        "Choice_link": 17
    },
    {
        "Choice_Description":"Reject the presence, destroy the effigies.",
        "Choice_link": 18
    }
    ]

    },
    {
        "Description": "You unsheathe your sword, swinging wildly at the bats resting above you. Many are sliced and crushed beneath your blade, but their kin begin to swarm and bite you, until you are overtaken by the mass of screeching black beasts",
        "Image_Path": "Images\\Monster_swarm.png",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            }
        ]
    },
    {
        "Description": "You calmly approach the man, gesturing that you mean no harm. You inquire about how he got here, yet all he says is, ''Don't let them take me.'' As you get closer, his eyes widen in fear. ''DEMON! DEMON!'' he screams. Before you can calm him down, he draws a knife and slashes his own throat. You rush to render aid, but it quickly becomes clear the man is already dead. Shaken from the event you've just witnessed, you quickly leave the room. You enter into a completely pitch black room, yet you sense you're not alone. From within the darkness, you spot a pair of glowing red eyes, and an unnatural, manic sounding voice begins speaking. ''HAH! it seems you have become acquainted with the poor sap who failed my little game... hopefully you fare better. Here's the deal mortal, you answer a series of three riddles correctly, I'll show you the way out of this place. Answer any of them wrong, and you'll end up like our little friend back there. Now, you're probably thinking to yourself, 'Why would I trust a pair of glowing red eyes to hold up his end of the deal?' You don't have an option! Isn't that the damndest thing! Now, for your first riddle, what is it that fills the sky and the earth, shakes all foundations, but cannot be seen by thine eyes or held in one's hands?'' ",
        "Image_Path": "Images\\Lone_man.png",
        "Choices": [
            {
                "Choice_Description":"''Wind''",
                "Choice_link": 19
            },
            {
                "Choice_Description":"''Lightning''",
                "Choice_link": 20
            },
            {
                "Choice_Description":"''Trees''",
                "Choice_link": 21
            }
        ]
    },
    {
        "Description": "You take a look at the murmuring mess before you and decide it's best not to take chances. You draw your sword and put the man out of his misery with a quick thrust into his chest. You make your way out of the room, leaving his body from whence you came. Upon exiting the room, you stumble into a pitch black room. Fumbling about and running your hands across the stone walls to gain a sense of direction, you hear a feminine voice call out from within the darkness, and spot the flickering light of a candle. ''Follow the light, weary traveler. I shall show you the way out of this place,'' says the voice. You see the figure of a lady illuminated by the candlelight, with silvery blonde hair clothed in a bright white gown. ",
        "Image_Path": "Images\\Dead_body.png",
        "Choices": [
            {
                "Choice_Description": "''What are you doing down here?''",
                "Choice_link": 22
            },
            {
                "Choice_Description": "''What is this place?''",
                "Choice_link": 23
            },
            {
                "Choice_Description": "Stay silent, follow the lady",
                "Choice_link": 24
            }
        ]
    },
    {
        "Description": "You do your best to not draw the crazy man's attention as you slowly walk across the room. Right as you make it to the exit, you hear him scream 'DEMON!' as he pounces on your back with dagger in hand. The blade slides into your neck, and you bleed out on the cold stone floor.",
        "Image_Path": "Images\\Crazy_man.png",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            }
        ]
    },
    {
        "Description": "You start stuffing the loot into your pack. Rifling through the the treasure, you find jewel-encrusted daggers, gems, fancy goblets, and the like. Your pack doesn't seem to ever get full, despite spending what feels like hours looting through the treasure. Out of the corner of your eye you spot a pale humanoid figure watching you. The figure is seemingly hairless, clothed in purple robes befitting of royalty, with a golden crown sitting atop its misshapen skull. The figure makes its way towards you. ",
        "Image_Path": "",
        "Choices": [
            {
                "Choice_Description":"Offer to put the treasure back",
                "Choice_link": 25
            },
            {
                "Choice_Description":"Attack the being",
                "Choice_link": 26
            },
            {
                "Choice_Description":"''Who goes there!''",
                "Choice_link": 27
            }
        ]
    },
    {
        "Description": "Even amongst all of the tempting treasure, you're unable to shake the uneasy feeling. As you look around the room, you spot a pale figure watching you intently. The figure is deathly pale, clothed in royal robes of purple, and a gold crown sits atop the overstretched skin on its pale skull. The figure begins to make his way towards you. ",
        "Image_Path": "",
        "Choices": [
            {
                "Choice_Description":"''What are you?''",
                "Choice_link": 28
            },
            {
                "Choice_Description":"''What is this place''",
                "Choice_link": 29
            },
            {
                "Choice_Description":"Stay silent, wait for the being to make a move",
                "Choice_link": 30
            }
        ]
    },
    {
        "Description": "You begin to make your way to the double doors across the treasure room, with the loot crunching under foot. As your hand grasps the handle to open the doors, you feel an icy presence run along the back of your neck. You tentatively turn around, and are greeted with the visage of a pale, undead humanoid inches from your face. The figure is clothed in purple robes, and a crown sits atop its hairless skull.",
        "Image_Path": "",
        "Choices": [
            {
                "Choice_Description":"''What are you?''",
                "Choice_link": 28
            },
            {
                "Choice_Description":"''What is this place?''",
                "Choice_link": 29
            },
            {
                "Choice_Description":"Stay silent, prepare yourself for violence if it comes to it.",
                "Choice_link": 30
            }
        ]
    },
    {
        "Description": "''What are you?'' you inquire to the unseen force surrounding you. At first, no response is given, but you begin to feel a powerful surge as a voice from the depths of the underworld responds. ''I am Molak-Durth, seventh prince of Helrak, sovereign of hate. Now, what is it that you seek mortal that would prompt you to dare question a prince of Helrak in his domain? Is it power beyond that of Man you lust after? Or are you merely a wayward traveler looking for a way out of this labyrinth? Ask and you shall receive, man-thing.'' ",
        "Image_Path": "Images\\Fantasy_altar.png",
        "Choices": [
            {
                "Choice_Description":"''I seek power.''",
                "Choice_link": 31
            },
            {
                "Choice_Description":"''I need a way out of this place.''",
                "Choice_link": 32
            },
            {
                "Choice_Description":"''I want not but for your destruction, demon-spawn!''",
                "Choice_link": 33
            }
        ]
    },
    {
        "Description": "You give in to the presence urging you towards the altar. Once there, you pick up the blood soaked dagger, though you are no longer in control of your actions. Detached from your own self, you observe that the dagger's blade is twisted and curved in an odd, exotic way, and the blade itself a dark ebony color underneath the crimson stains. ''My life for Molak-Durth'', you say, yet the voice is not your own. It matters little, as you plunge the blade into your chest, and all goes black...  ",
        "Image_Path": "Images\\Fantasy_altar.png",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            }
        ]
    },
    {
        "Description": "You fight against the dark force tempting you towards the altar. Raging against its hold, you begin to go around the room toppling every statue and idol related to this dark being. ''YOU DARE DEFILE MY SHRINES, YOU DISGUSTING MAN-THING!'', a voice from the depths bellows out. The floor beneath you starts to tremble, as if you were in the midst of an earthquake. The room begins to crumble around you, and a chunk of stone dislodges from the ceiling, nearly crushing you. Looking up to where the stone fell, you notice the light of the sun peeking through the opening. You scramble up the rubble that has now formed a makeshift stairway into the outside world. Once outside, you faintly hear the angered howls of whatever being inhabited that place. Exhausted, you lie down beneath a nearby tree, savoring the sight of the sun and the feel of the earth beneath your feet.  ",
        "Image_Path": "Images\\Fantasy_altar.png",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            }
        ]
    },
    {
        "Description": "''You're not as dumb as you look, sadly... Anyways, you've got two more to go. What is it that speaks in all languages, yet is silent when it rests, and is deaf for all its life?''",
        "Image_Path": "",
        "Choices": [
            {
                "Choice_Description":"''A snake''",
                "Choice_link": -1
            },
            {
                "Choice_Description":"''A quill''",
                "Choice_link": -1
            },
            {
                "Choice_Description":"''Money''",
                "Choice_link": -1
            }
        ]
    },
    {
        "Description": "The being doesn't respond, and you can feel the tension within the silence. Suddenly, you see a flash of claws and fangs emerge from the darkness as you feel sharp pain throughout your body, and all goes black...",
        "Image_Path": "",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            }
        ]
    },
    {
        "Description": "The word has barely finished leaving your mouth before the being launches itself from the darkness, claws outstretched in a frenzy of ripping and tearing. That would be the last image you would ever see...",
        "Image_Path": "",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            }
        ]
    },
    {
        "Description": "''I am no mere maiden. I have been cursed to walk this place to my dying day, guiding wayward souls like you out of this dark place,'' the lady responds. You follow her lead through the tunnels of the labyrinth for what feels like ages, until you arrive at an underground pond, the water crystal clear and shimmering. The lady stops at the foot of the pond, staring at her reflection. You walk up to her left shoulder, taking a moment to glance at your own reflection, your face covered in grime and dirt, nearly unrecognizable from your time in this place. You then notice the lady's reflection, of which there is something deeply wrong with. Her face seems to be contorting and shifting inhumanly, as if something was trying to break free out of her face. She, or rather it, begins to shake with laughter. ''Did you actually think I was leading you out of this place? HA! You killed that poor fool blabbering about a demon, and you didn't find it odd there was nothing but a woman in the next room? You honestly deserve what I'm going to do you,'' the creature tells you, shifting its form in front of your very eyes. It grabs you by the hair with inhumanly strong hands and plunges your face into the water below. You struggle, but you lack the strength to break free. Water begins to fill your lungs, though submerged in the water, you can still hear the being's maniacal laughter as your life fades...  ",
        "Image_Path": "",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            }
        ]
    },
    {
        "Description": "''I do not know the true nature of this labyrinth, I barely know the true nature of myself. For as long as I can remember, I've been wandering this place. On random chance I'll encounter travelers such as yourself, but they always seem to meet grizzly ends, such as the man you killed back there.'' You stand still in shock, how could she know about the man you killed? Sensing your discomfort, the lady stops in her tracks and begins to laugh uncontrollably. ''What? Did you think I didn't know? What demon do you think he was raving about? You just thought you would be saved by some fair maiden after showing no such mercy yourself... fate has a cruel sense of justice, not that I've ever been one for the concept of justice.'' The lady turns to face you, what was once her face now contorted in an inhumanly long grin, with teeth sharp as knives glistening in the candle light. You rush to draw your sword, but before it can be unsheathed the being is on top of you, and your death is swiftly dispatched.",
        "Image_Path": "",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            }
        ]
    },
    {
        "Description": "You silently trudge along, following the the path illuminated by the lady. ''No words of thanks for guiding you out of this place? Seems befitting of one who would oh so cruelly kill that poor lunatic back there.'' The lady stops in her tracks and begins laughing. ''Not only are you an ingrate, you're also a fool. Was it really the wisest course of action to follow some random lady after just meeting a man rambling about demons? You're as dumb as you are cruel.'' The lady's form starts shifting into some grotesque mockery of the human figure, and before you can react the demon is charging you, claws outstretched. You fumble around, reaching for your weapon, but you are too late. The demon is on top of you, and the last thing you see is the gnashing of bloody teeth and claws swinging down at you.",
        "Image_Path": "",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            }
        ]
    },
    {
        "Description": "You begin dumping the loot from your pack to appease",
        "Image_Path": "",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            }
        ]
    }


]
