[

    {
        "Description": "You awake in a stupor, unaware of your surroundings. Fighting the throbbing pain in your head, you surmise that you are in some sort of dungeon. \nThere are three tunnels leading from the room, one to the left, right and center. Which way will you go?",
        "Image_Path": "Images\\Awakening.png",
        "Choices": [
            {
                "Choice_Description": "Left",
                "Choice_link": 1
            },
            {
                "Choice_Description": "Center",
                "Choice_link": 2
            },
            {
                "Choice_Description": "Right",
                "Choice_link": 3
            }
        ]

    },
    {

        "Description": "Making your way down the left most tunnel, you stumble into a cavern that doesn't appear to have been man made. As your eyes adjust to the darkness, you make out a large, lumbering silhouette charging towards you.\nThe beast's stench can only mean one thing, an ogre. What will you do?",
        "Image_Path": "Images\\Ogre.png",
        "Choices": [
            {
                "Choice_Description": "Fight",
                "Choice_link": 4
            },
            {
                "Choice_Description": "Attempt to make peace",
                "Choice_link": 5
            },
            {
                "Choice_Description": "Run back down the tunnel",
                "Choice_link": 6
            }
        ]
        
    },
    {
        "Description": "Walking down the center tunnel, you stumble into a completely dark room. Your eyes strain to perceive what appears to be unlit torches hanging on the walls.\n You come to realize you are not alone, as the chirping and fluttering of bats begins to fill your ears. How do you react?",
        "Image_Path": "Images\\Ogre.png",
        "Choices": [
            {
                "Choice_Description": "Light the torches",
                "Choice_link": 7
            },
            {
                "Choice_Description": "Attack the bats",
                "Choice_link": 8
            },
            {
                "Choice_Description": "Sneak through the room",
                "Choice_link": 9
            }
        ]
    },
    {
        "Description": "Choosing the right tunnel, you come to a circular chamber. Once within, you make out inane human ramblings coming from a haggard, bloodied adventurer.\nYou step closer to comfort him, yet his mutterings only grow more frenzied. What will you do?",
        "Image_Path": "Images\\Ogre.png",
        "Choices": [
            {
                "Choice_Description": "Talk to him in an attempt to calm him down",
                "Choice_link": 10
            },
            {
                "Choice_Description": "Take no chances, kill him",
                "Choice_link": 11
            },
            {
                "Choice_Description": "Ignore him and attempt to walk past him",
                "Choice_link": 12
            }
        ]
    },
    {
        "Description": "You throw down your longsword and kneel to the ground as the ogre charges you. Right as it is about to strike you down it pauses, confused at your gesture.\n Seeing that you don't intend to make yourself a threat, it lets you pass by unharmed. You pass through a small man-sized hole in the cavern into a large vault, with jewels and gold littered throughout the room.\nDespite the splendor of it all, an air of unease hangs over you. Something is not quite right. What will you do?",
        "Image_Path": "Images\\Ogre.png",
        "Choices": [
            {
                "Choice_Description": "Ignore the uneasy feeling, stuff as much loot as you can into your pack as it can hold",
                "Choice_link": 13

            },
            {
                "Choice_Description": "Survey the room for the source of uneasiness",
                "Choice_link": 14
            },
            {
                "Choice_Description": "Waste no time leaving the room",
                "Choice_link": 15
            }
        ]
    },
    {
        "Description": "As the ogre charges you, you draw your longsword and assume a defensive stance. Right as it is about to barrel into you, you sidestep to the left and swing at its throat. The beast falls over dead.\nYou pass through a small man-sized hole in the cavern into a large vault, with jewels and gold littered throughout the room. Despite the splendor of it all, an air of unease hangs over you. Something is not quite right. What will you do?",
        "Image_Path": "Images\\Ogre_charging.png",
        "Choices": [
            {
                "Choice_Description": "Ignore the uneasy feeling, stuff as much loot as you can into your pack as it can hold",
                "Choice_link": 13

            },
            {
                "Choice_Description": "Survey the room for the source of uneasiness",
                "Choice_link": 14
            },
            {
                "Choice_Description": "Waste no time leaving the room",
                "Choice_link": 15
            }
        ]
    },
    {
        "Description": "You attempt to run back down the tunnel you came from. Right as you reach the opening, you feel a large hand grip your waist. The ogre picks you up and slams you into the ground repeatedly, until the only thing that remains of you is red paste.",
        "Image_Path": "Images\\Ogre_death.png",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            }
        ]
    },
    {
        "Description": "You take a matchbox from your pack, lighting the nearby torches. The bats begin to stir angrily until the flames scare them away. You make your way out of the room. The frightened bats you fled from suddenly look more appealing than the sight currently in front of you. You are standing in a stone room, lit by candlelight. In the center of the room is an altar, on top of which lays a bloody dagger. Various effigies to some bat-like deity aline the room. You feel a dark presence beckoning you to the knife.",
        "Image_Path": "Images\\bat_torches.png",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": 16
            },
            {
                "Choice_Description":"",
                "Choice_link": 17
            },
            {
                "Choice_Description":"",
                "Choice_link": 18
            }
        ]


    },
    {
    "Description": "You creep across the room, taking great care not disturb the sleeping bats. You run your hands along the wall until you find a door. Swinging it open, you quickly pass through and slam it shut. Once out, you hear the angry whir of the bats behind the door. The screeching bats you fled from suddenly look more appealing than the sight currently in front of you. You are standing in a stone room, lit by candlelight. In the center of the room is an altar, on top of which lays a bloody dagger. Various effigies to some bat-like deity aline the room. You feel a dark presence beckoning you to the knife.",
    "Image_Path": "Images\\Dark_cave.png",
    "Choices": [
    {
        "Choice_Description":"Attempt to speak to the deity",
        "Choice_link": 16
    },
    {
        "Choice_Description":"Give in to the dark presence.",
        "Choice_link": 17
    },
    {
        "Choice_Description":"Reject the presence, destroy the effigies.",
        "Choice_link": 18
    }
    ]

    },
    {
        "Description": "You unsheathe your sword, swinging wildly at the bats resting above you. Many are sliced and crushed beneath your blade, but their kin begin to swarm and bite you, until you are overtaken by the mass of screeching black beasts",
        "Image_Path": "Images\\Monster_swarm.png",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            }
        ]
    },
    {
        "Description": "You calmly approach the man, gesturing that you mean no harm. You inquire about how he got here, yet all he says is, 'Don't let them take me.' As you get closer, his eyes widen in fear. 'DEMON! DEMON!' he screams. Before you can calm him down, he draws a knife and slashes his own throat.",
        "Image_Path": "Images\\Lone_man.png",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": 19
            },
            {
                "Choice_Description":"",
                "Choice_link": 20
            },
            {
                "Choice_Description":"",
                "Choice_link": 21
            }
        ]
    },
    {
        "Description": "You take a look at the murmuring mess before you and decide it's best not to take chances. You draw your sword and put the man out of his misery with a quick thrust into his chest. You make your way out of the room, leaving his body from whence you came.",
        "Image_Path": "Images\\Dead_body.png",
        "Choices": [
            {
                "Choice_Description": "",
                "Choice_link": 22
            },
            {
                "Choice_Description": "",
                "Choice_link": 23
            },
            {
                "Choice_Description": "",
                "Choice_link": 24
            }
        ]
    },
    {
        "Description": "You do your best to not draw the crazy man's attention as you slowly walk across the room. Right as you make it to the exit, you hear him scream 'DEMON!' as he pounces on your back with dagger in hand. The blade slides into your neck, and you bleed out on the cold stone floor.",
        "Image_Path": "Images\\Crazy_man.png",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            }
        ]
    },
    {
        "Description": "You start stuffing the loot into your pack. Rifling through the the treasure, you find jewel-encrusted daggers, gems, fancy goblets, and the like. Your pack doesn't seem to ever get full, despite spending what feels like hours looting through the treasure. Out of the corner of your eye you spot a pale humanoid figure watching you. The figure is seemingly hairless, clothed in purple robes befitting of royalty, with a golden crown sitting atop its misshapen skull. The figure makes its way towards you. ",
        "Image_Path": "",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": 0
            },
            {
                "Choice_Description":"",
                "Choice_link": 0
            },
            {
                "Choice_Description":"",
                "Choice_link": 0
            }
        ]
    },
    {
        "Description": "Even amongst all of the tempting treasure, you're unable to shake the uneasy feeling. As you look around the room, you spot a pale figure watching you intently. The figure is deathly pale, clothed in royal robes of purple, and a gold crown sits atop the overstretched skin on its pale skull. The figure begins to make his way towards you. ",
        "Image_Path": "",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": 0
            },
            {
                "Choice_Description":"",
                "Choice_link": 0
            },
            {
                "Choice_Description":"",
                "Choice_link": 0
            }
        ]
    },
    {
        "Description": "You begin to make your way to the double doors across the treasure room, with the loot crunching under foot. As your hand grasps the handle to open the doors, you feel an icy presence run along the back of your neck. You tentatively turn around, and are greeted with the visage of a pale, undead humanoid inches from your face. The figure is clothed in purple robes, and a crown sits atop its hairless skull.",
        "Image_Path": "",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": 0
            },
            {
                "Choice_Description":"",
                "Choice_link": 0
            },
            {
                "Choice_Description":"",
                "Choice_link": 0
            }
        ]
    },
    {
        "Description": "''What are you?'' you inquire to the unseen force surrounding you. At first, no response is given, but you begin to feel a powerful surge as a voice from the depths of the underworld responds. ''I am Molak-Durth, seventh prince of Helrak, sovereign of hate. Now, what is it that you seek mortal that would prompt you to dare question a prince of Helrak in his domain? Is it power beyond that of Man you lust after? Or are you merely a wayward traveler looking for a way out of this labyrinth? Ask and you shall receive, man-thing.'' ",
        "Image_Path": "Images\\Fantasy_altar.png",
        "Choices": [
            {
                "Choice_Description":"''I seek power.''",
                "Choice_link": 0
            },
            {
                "Choice_Description":"''I need a way out of this place.''",
                "Choice_link": 0
            },
            {
                "Choice_Description":"''I want not but for your destruction, demon-spawn!''",
                "Choice_link": 0
            }
        ]
    },
    {
        "Description": "You give in to the presence urging you towards the altar. Once there, you pick up the blood soaked dagger, though you are no longer in control of your actions. Detached from your own self, you observe that the dagger's blade is twisted and curved in an odd, exotic way, and the blade itself a dark ebony color underneath the crimson stains. ''My life for Molak-Durth'', you say, yet the voice is not your own. It matters little, as you plunge the blade into your chest, and all goes black...  ",
        "Image_Path": "Images\\Fantasy_altar.png",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            }
        ]
    },
    {
        "Description": "You fight against the dark force tempting you towards the altar. Raging against its hold, you begin to go around the room toppling every statue and idol related to this dark being. ''YOU DARE DEFILE MY SHRINES, YOU DISGUSTING MAN-THING!'', a voice from the depths bellows out. The floor beneath you starts to tremble, as if you were in the midst of an earthquake. The room begins to crumble around you, and a chunk of stone dislodges from the ceiling, nearly crushing you. Looking up to where the stone fell, you notice the light of the sun peeking through the opening. You scramble up the rubble that has now formed a makeshift stairway into the outside world. Once outside, you faintly hear the angered howls of whatever being inhabited that place. Exhausted, you lie down beneath a nearby tree, savoring the sight of the sun and the feel of the earth beneath your feet.  ",
        "Image_Path": "Images\\Fantasy_altar.png",
        "Choices": [
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            },
            {
                "Choice_Description":"",
                "Choice_link": -1
            }
        ]
    }
]
